app/views/events/all_events.html.erb

        <table class="min-w-full divide-y divide-gray-200">
          <% if Event.all.empty? %>
---
SELECT "events".* FROM "events" WHERE (date > '2021-06-29')