app/views/events/index.html.erb

SELECT "events".* FROM "events" WHERE "events"."user_id" = ? AND (date > '2021-06-29')  [["user_id", 2]]
---
          </thead>
          <% current_user.events.upcoming.each do |event| %>

SELECT "events".* FROM "events" WHERE "events"."user_id" = ? AND (date < '2021-06-29')  [["user_id", 2]]
---
          <% end %>
          <% current_user.events.attended.each do |event| %>