app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (date > '2021-06-29')
---
  def all_events
    @events = Event.all

INSERT INTO "events" ("name", "location", "date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @event = current_user.events.build(event_params)

    if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "events" SET "date" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["date", "2021-06-16 15:00:00"], ["updated_at", "2021-06-16 02:49:25.082033"], ["id", 1]]
---
  def update
    @event = Event.find(params[:id])
    @event.update(event_params)

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 2]]
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def presence_in
    @event = Event.find(params[:id])
    if @event.attendees.include?(current_user)

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "invitations" ("created_at", "updated_at", "attendee_id", "attended_event_id") VALUES (?, ?, ?, ?)  [["created_at", "2021-06-16 23:46:29.890503"], ["updated_at", "2021-06-16 23:46:29.890503"], ["attendee_id", 2], ["attended_event_id", 1]]
---
  def send_invite
    @event = Event.find(params[:id])
    @invited_user = User.find(params[:invited_user_id])
    if @event.invited_users.include?(@invited_user)
      flash[:alert] = "'#{@invited_user.name}' has already accepted the invitation!"
    else
      flash[:notice] = "'#{@invited_user.name}' invited!"
      @event.invited_users << @invited_user