app/controllers/events_controller.rb

INSERT INTO "events" ("name", "location", "date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test"], ["location", "Your house"], ["date", "2021-06-09 14:42:00"], ["user_id", 1], ["created_at", "2021-06-09 14:43:02.165605"], ["updated_at", "2021-06-09 14:43:02.165605"]]
---
  def create
    @event = current_user.events.build(event_params)

    if @event.save

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 9]]
---
  def destroy
    @event = Event.find(params[:id])
    @event.delete